OpenFoam Final Project/mach-3-ramp-15/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version  2.0;
	format   ascii;
	class    dictionary;
	object   blockMeshDict;
}

convertToMeters 1.0;

vertices
(
	( 0.000000e+00 0.000000e+00 -5.000000e-02 ) // 0
	( 6.000000e-01 0.000000e+00 -5.000000e-02 ) // 1
	( 1.346410e+00 2.000000e-01 -5.000000e-02 ) // 2
	( 0.000000e+00 1.000000e+00 -5.000000e-02 ) // 3
	( 6.000000e-01 1.000000e+00 -5.000000e-02 ) // 4
	( 1.346410e+00 8.000000e-01 -5.000000e-02 ) // 5
	( 3.000000e+00 2.000000e-01 -5.000000e-02 ) // 6
	( 3.000000e+00 8.000000e-01 -5.000000e-02 ) // 7
	( 0.000000e+00 0.000000e+00 5.000000e-02 ) // 8
	( 6.000000e-01 0.000000e+00 5.000000e-02 ) // 9
	( 1.346410e+00 2.000000e-01 5.000000e-02 ) // 10
	( 0.000000e+00 1.000000e+00 5.000000e-02 ) // 11
	( 6.000000e-01 1.000000e+00 5.000000e-02 ) // 12
	( 1.346410e+00 8.000000e-01 5.000000e-02 ) // 13
	( 3.000000e+00 2.000000e-01 5.000000e-02 ) // 14
	( 3.000000e+00 8.000000e-01 5.000000e-02 ) // 15
);

blocks
(

	// block 0 
	hex ( 0  1  4  3  8  9 12 11) ( 96 128  1) simpleGrading ( 1.000000e+00 1.000000e+00 1.0)
	// block 1 
	hex ( 1  2  5  4  9 10 13 12) ( 192 128  1) simpleGrading ( 1.000000e+00 1.000000e+00 1.0)
	// block 2 
	hex ( 2  6  7  5 10 14 15 13) ( 288 128  1) simpleGrading ( 1.000000e+00 1.000000e+00 1.0)

);

edges
(



);

boundary
(

	inlet
	{
		type patch;
		faces
		(
			( 0  8 11  3)
		);
	}

	outlet
	{
		type patch;
		faces
		(
			( 6 14 15  7)
		);
	}

	bottom
	{
		type symmetryPlane;
		faces
		(
			( 0  1  9  8)
		);
	}

	top
	{
		type symmetryPlane;
		faces
		(
			( 3 11 12  4)
		);
	}

	obstacle
	{
		type patch;
		faces
		(
			( 4 12 13  5)
			( 5 13 15  7)
			( 1  9 10  2)
			( 2 10 14  6)
		);
	}

);
mergePatchPairs
(
);

// ************************************************************************* //
